[
  {
    "id": "start",
    "title": "L'arrivée",
    "flavorText": "Une terre inconnue s’étend devant vous. Les membres de votre tribu ont froid et ne possèdent que quelques provisions pour survivre aux premiers jours. Leurs regards se tournent vers le ciel à la recherche d’un signe. Un feu pourrait les rassembler. ",
    "image": "/images/tutorial/start_fire.png",
    "explanation": "Cliquez sur le menu situé à droite de l’écran : c’est là que vous trouverez les bâtiments disponibles.\n\nSélectionnez le 'Feu de camp'. Puis, placez-le dans une zone dégagée de la carte, là où rien ne gêne la construction.\n\nCe feu marquera le début de votre village.",
    "check": "ALWAYS"
  },
  {
    "id": "afterCampfire",
    "title": "Les foyers",
    "flavorText": "Ils se sont approchés du feu, d’abord pour sa chaleur, puis pour parler, puis pour s’organiser. Ce feu n’est plus seulement un abri : c’est le centre du camp. Une nouvelle vie commence à se structurer.",
    "image": "/images/tutorial/fire_unlocked.png",
    "explanation": "Construisez maintenant des habitations autour du feu pour augmenter votre population.\n\nAttention : elles doivent impérativement être placées dans son rayon d’influence (à quelques cases autour).\n\nS’il n’y a pas assez de place, utilisez l’outil 'pelle' pour couper quelques arbres et libérer de l’espace.",
    "check": "campfire >= 1"
  },
  {
    "id": "afterThreeBranchHuts",
    "title": "La faim",
    "flavorText": "Le camp abrite maintenant plusieurs familles. Mais les ventres se vident et les réserves diminuent. Il faut trouver de la nourriture avant que la famine ne s’installe.",
    "image": "/images/tutorial/hunting_traps.png",
    "explanation": "En haut à droite sont indiqués votre nombre d'habitants. Pour chaque population, 1 ressource de nourriture sera régulièrement consommée.\n\nPlacez une cabane de chasse sur une case où se trouve du gibier (icône de cerf) pour produire de la viande.\n\nS'il n'y a plus de gibier disponible, vous pouvez aussi placer des zones de cueillette dans l'onglet Récolte pour obtenir des plantes comestibles.",
    "check": "branch_hut >= 3"
  },
  {
    "id": "afterHuntingTraps",
    "title": "La roche",
    "flavorText": "Les chasseurs ramènent de quoi manger, mais vos outils restent rudimentaires. Pour construire davantage, il va falloir extraire et utiliser la pierre.",
    "image": "/images/tutorial/stone_quarry.png",
    "explanation": "Accumulez assez de coquillages pour constuire la 'Carrière de pierre' dans le menu des industries. Elle ne peut être placée qu’à côté d’une montagne.\n\nCette dernière produira régulièrement de la pierre brute, indispensable à votre village, mais demandera un léger entretien en or.",
    "check": "hunting_traps >= 1"
  },
  {
    "id": "afterStoneQuarry",
    "title": "Le dépôt",
    "flavorText": "La pierre s’accumule, mais sans lieu de stockage, le travail ralentit. Une tribu qui construit doit aussi savoir s’organiser.",
    "image": "/images/tutorial/storage_shelter.png",
    "explanation": "Placez un abri de stockage dans une zone dégagée.\n\nIl ne génère pas de ressources, mais permet de débloquer les bâtiments industriels, qui doivent être construits à proximité immédiate.\n\nCommencez par un atelier de tailleur de pierre qui produira des outils, puis ajoutez une fosse de tannage pour produire du cuir.",

    "check": "stone_quarry >= 1"
  },
  {
    "id": "afterStoneAndTanners",
    "title": "L'entretien",
    "flavorText": "Le village entre dans une nouvelle phase. Les premiers ateliers transforment les ressources, et l’organisation du travail devient essentielle.",
    "image": "/images/tutorial/economy_warning.png",
    "explanation": "Si un icône de danger apparaît sur un bâtiment, cela veut dire qu'il manque de main-d’œuvre. Pour y remédier, augmentez votre population en construisant plus d'habitations.\n\nContinuez votre progression jusqu’à pouvoir bâtir un abri en peaux.",
    "check": "stonecutter >= 1 AND tanning_pit >= 1"
  },
  {
    "id": "afterLeatherShelter",
    "title": "La liberté",
    "flavorText": "Avec un toit, de la nourriture et des outils, vos gens ne pensent plus seulement à survivre. Le village peut maintenant se développer selon votre vision.",
    "image": "/images/tutorial/faith_intro.png",
    "explanation": "Vous êtes désormais libre de bâtir comme bon vous semble. Certains bâtiments, comme le feu de camp ou les monuments religieux, produisent de la foi.\n\nLa foi est une ressource essentielle pour ériger les bâtiments du savoir, qui ouvrent l’accès à de nouvelles constructions.\n\nAvancez dans votre développement jusqu’à pouvoir construire une ferme primitive, garantissant la prospérité de votre tribu.",
    "check": "leather_shelter >= 1"
  },
  {
    "id": "firstRuin",
    "title": "Ce qui s’effondre",
    "flavorText": "Une habitation s’est effondrée. Faute de nourriture, ses occupants ont fui ou disparu. Sans ressources, le village commence à se vider.",
    "image": "/images/tutorial/ruin_warning.png",
    "explanation": "Sans nourriture, vos gens fuient ou disparaissent. Plus la famine dure, plus les habitations s’effondrent. Il faut agir vite pour nourrir votre village.",
    "check": "ruin >= 1"
  },
  {
    "id": "afterPrimitiveFarm",
    "title": "Vers l'abondance",
    "flavorText": "Un champ de blé s’étend désormais aux abords du village. Grâce au puits et à l’organisation mise en place, votre peuple produit enfin sa propre nourriture. La survie laisse place à la prospérité.",
    "image": "/images/tutorial/primitive_farm.png",
    "explanation": "Félicitations, vous avez accompli les étapes fondamentales pour assurer la survie et le développement de votre village. Vous pouvez maintenant continuer, ou recommencer pour bâtir une nouvelle colonie.",
    "check": "primitive_farm >= 1"
  },
  {
    "id": "debtWarning",
    "title": "Plus un coquillage",
    "flavorText": "On raconte que les premières tribus troquaient des coquillages. Aujourd’hui, votre peuple n’en a plus. Certains proposent de démonter les structures les moins utiles.",
    "image": "/images/tutorial/debt_warning.png",
    "explanation": "Votre réserve de coquillages est tombée en dessous de zéro. Cela signifie que vos revenus ne couvrent plus les dépenses. Supprimez les bâtiments les plus couteux pour rétablir l’équilibre.",
    "check": "gold < 0"
  }
]
