[
  {
    "id": "start",
    "title": "L'arrivée",
    "flavorText": "Vous venez d’arriver sur une terre inconnue. Vos gens ont froid, ils serrent contre eux leurs maigres provisions, juste de quoi survivre les premiers jours. Ils lèvent les yeux vers le ciel, en quête d’un signe. Un feu pourrait les rassembler.",
    "image": "/images/tutorial/start_fire.png",
    "explanation": "Ouvrez le menu situé à droite de l’écran pour accéder aux bâtiments essentiels. Sélectionnez le 'Feu de camp', puis placez-le dans une zone dégagée de la carte.",
    "check": "ALWAYS"
  },
  {
    "id": "afterCampfire",
    "title": "Les foyers",
    "flavorText": "Ils se sont approchés du feu, d’abord pour sa chaleur, puis pour parler, puis pour s’organiser. Ce feu n’est plus seulement un abri : c’est le centre du camp. Une nouvelle vie commence à se structurer.",
    "image": "/images/tutorial/fire_unlocked.png",
    "explanation": "Vous pouvez désormais construire des habitations autour du feu. Celles-ci doivent impérativement être placées dans son rayon d’influence. N’hésitez pas à déboiser quelques arbres avec l'outil 'pelle' pour libérer suffisamment d’espace.",
    "check": "campfire >= 1"
  },
  {
    "id": "afterThreeBranchHuts",
    "title": "La faim",
    "flavorText": "Le camp abrite maintenant plusieurs familles. Mais les ventres se vident et les réserves diminuent. Il faut trouver de la nourriture avant que la famine ne s’installe.",
    "image": "/images/tutorial/hunting_traps.png",
    "explanation": "Placez une cabane de chasse pour produire de la viande et nourrir votre population. Ce bâtiment peut être installé sur n’importe quelle case libre.",
    "check": "branch_hut >= 3"
  },
  {
    "id": "afterHuntingTraps",
    "title": "La roche",
    "flavorText": "Les chasseurs ramènent de quoi manger, mais vos outils restent rudimentaires. Pour construire davantage, il va falloir extraire et utiliser la pierre.",
    "image": "/images/tutorial/stone_quarry.png",
    "explanation": "Attendez d'avoir les coquillages nécessaires et construisez une carrière de pierre. Ce bâtiment ne peut être placé que près des montagnes : cherchez un terrain adjacent à une zone rocheuse grise.",
    "check": "hunting_traps >= 1"
  },
  {
    "id": "afterStoneQuarry",
    "title": "Le dépôt",
    "flavorText": "La pierre s’accumule, mais sans lieu de stockage, le travail ralentit. Une tribu qui construit doit aussi savoir s’organiser.",
    "image": "/images/tutorial/storage_shelter.png",
    "explanation": "Construisez un abri de stockage près de votre campement. C’est autour de cet abri que vous pourrez ensuite implanter vos bâtiments industriels. Commencez par placer un atelier de tailleur de pierre à côté de cet abri, et placez d'autres industries ensuite.",
    "check": "stone_quarry >= 1"
  },
  {
    "id": "afterStoneAndTanners",
    "title": "L'entretien",
    "flavorText": "Le village entre dans une nouvelle phase. Les premiers ateliers transforment les ressources, et l’organisation du travail devient essentielle.",
    "image": "/images/tutorial/economy_warning.png",
    "explanation": "La plupart des bâtiments coûtent des coquillages en entretien et produisent des ressources. Si un bâtiment affiche une icône de danger, c’est qu’il manque de main d'œuvre pour fonctionner. Avancez dans la construction de votre village jusqu'à pouvoir construire votre premier abri en peau.",
    "check": "stonecutter >= 1 AND tanning_pit >= 1"
  },
  {
    "id": "afterLeatherShelter",
    "title": "La liberté",
    "flavorText": "Avec un toit, de la nourriture et des outils, vos gens ne pensent plus seulement à survivre. Le village peut maintenant se développer selon votre vision.",
    "image": "/images/tutorial/faith_intro.png",
    "explanation": "Vous êtes désormais libre de bâtir comme bon vous semble. Certains bâtiments, comme le feu de camp ou les monuments religieux, produisent de la foi. Cette ressource vous sera précieuse pour progresser vers de nouvelles ères.",
    "check": "leather_shelter >= 1"
  },
  {
    "id": "firstRuin",
    "title": "Ce qui s’effondre",
    "flavorText": "Une habitation s’est effondrée. Faute de nourriture, ses occupants ont fui ou disparu. Sans ressources, le village commence à se vider.",
    "image": "/images/tutorial/ruin_warning.png",
    "explanation": "Sans nourriture, vos gens fuient ou disparaissent. Plus la famine dure, plus les habitations s’effondrent. Il faut agir vite pour nourrir votre village.",
    "check": "ruin >= 1"
  },
  {
    "id": "afterPrimitiveFarm",
    "title": "Vers l'abondance",
    "flavorText": "Un champ de blé s’étend désormais aux abords du village. Grâce au puits et à l’organisation mise en place, votre peuple produit enfin sa propre nourriture. La survie laisse place à la prospérité.",
    "image": "/images/tutorial/primitive_farm.png",
    "explanation": "Félicitations, vous avez accompli les étapes fondamentales pour assurer la survie et le développement de votre village. Vous pouvez maintenant continuer, ou recommencer pour bâtir une nouvelle colonie.",
    "check": "primitive_farm >= 1"
  },
  {
    "id": "debtWarning",
    "title": "Plus un coquillage",
    "flavorText": "On raconte que les premières tribus troquaient des coquillages. Aujourd’hui, votre peuple n’en a plus. Certains proposent de démonter les structures les moins utiles.",
    "image": "/images/tutorial/debt_warning.png",
    "explanation": "Votre réserve de coquillages est tombée en dessous de zéro. Cela signifie que vos revenus ne couvrent plus les dépenses. Supprimez les bâtiments les plus couteux pour rétablir l’équilibre.",
    "check": "gold < 0"
  }
]
